Namespaces | Classes | Enumerations | Functions | Variables
ACAPI::MEP Namespace Reference
 Namespaces
namespace  | Adapter
namespace  | Impl
namespace  | v1
 Classes
class  | Accessory
The Accessory is a complex element with two ports on a single axis. More...
class  | AccessoryDefault
The AccessoryDefault contains the necessary non-geometric data for creating an Accessory element. More...
class  | Bend
The Bend can connect two straight RoutingSegments with the same dimensions but different directions. More...
class  | BendDefault
The BendDefault contains the necessary non-geometric data for modifying a Bend. More...
class  | Branch
A branch is a specific type of fitting that acts as an outlet from a large pipe to a smaller pipe or one of equal size. More...
class  | BranchDefault
class  | CableCarrierPort
The CableCarrierPort represents a connection point of a cable carrier. More...
class  | CableCarrierPreferenceTableContainer
The CableCarrierPreferenceTableContainer can contain several PreferenceTableBase associated with cable carriers. More...
class  | DuctPreferenceTableContainer
The DuctPreferenceTableContainer can contain several PreferenceTableBase associated with ventilation. More...
class  | Element
The Element represents an instantiable ElementBase. More...
class  | ElementBase
class  | ElementDefault
The ElementDefault contains the necessary non-geometric data for creating a MEP element. More...
class  | Equipment
The Equipment is a complex element with more than two ports. More...
class  | EquipmentDefault
The EquipmentDefault contains the necessary non-geometric data for creating an Equipment element. More...
class  | Fitting
A fitting is used in distribution systems to connect straight sections of pipes and ducts, adapting to different sizes or shapes. More...
class  | FittingDefault
The FittingDefault contains the necessary non-geometric data for creating a Fitting element. More...
class  | FlexibleSegment
In contrast to rigid segments flexible duct is not a connection of multiple elements (straight segments and bends), instead a type of ducting pipe that could easily be bent in different angles. More...
class  | FlexibleSegmentDefault
The FlexibleSegmentDefault contains the necessary non-geometric data for creating a FlexibleSegment element. More...
class  | ModifiableElement
The Modifiable Element represents an instantiable ModifiableElementBase. More...
class  | ModifiableElementBase
The ModifiableElementBase contains the available modifying actions for ElementBase. More...
struct  | Orientation
Defines the orientation with the help of a direction and rotation vector. More...
class  | PipePreferenceTableContainer
The PipePreferenceTableContainer can contain several PreferenceTableBase associated with piping. More...
class  | PipingPort
The PipingPort represents a connection point of a pipe segment. More...
class  | Port
The Port represents an instantiable PortBase. Through this object you can reference to the three domain's ports in a common way. More...
class  | PortBase
The Port is associated to an element and it represents a point between elements. More...
class  | PreferenceTableBase
The PreferenceTableBase represents a named entity, that contains inner tables associated with cross section shapes and these table contains rows that consists of a size and a description. The rows have to be unique by value and are always in ascending order. More...
class  | PreferenceTableContainerBase
The PreferenceTableContainerBase contains PreferenceTables, and you can Add/Get/Delete them. More...
class  | RigidSegment
The RigidSegment is placed in RoutingSegments. More...
class  | RigidSegmentDefault
The RigidSegmentDefault contains the necessary non-geometric data for creating a RigidSegment element. More...
class  | RoutingElement
The RoutingElement can contain Routing Segments and Routing Nodes. More...
class  | RoutingElementDefault
The RoutingElementDefault contains the necessary non-geometric data for creating a Routing element. More...
class  | RoutingNode
The RoutingNode can contain Bend and Transition elements. More...
class  | RoutingNodeDefault
The RoutingNodeDefault contains the necessary non-geometric data for creating and modifying a Routing Node. More...
class  | RoutingSegment
The RoutingSegment can contain Rigid Segment elements. More...
struct  | RoutingSegmentCrossSectionData
Defines the necessary data for placing RoutingSegments of a RouteElement. More...
class  | RoutingSegmentDefault
The RoutingSegmentDefault contains the necessary non-geometric data for creating and modifying a Routing Segment. More...
class  | Terminal
The Terminal is a complex element with a single port. More...
class  | TerminalDefault
The TerminalDefault contains the necessary non-geometric data for creating a Terminal element. More...
class  | Transition
The Transition is an element that connects two different Routing Segments. More...
class  | TransitionDefault
The TransitionDefault contains the necessary non-geometric data for creating and modifying a Transition. More...
class  | UniqueID
class  | VentilationPort
The VentilationPort represents a connection point of a duct. More...
 Enumerations
enum class  | Domain { Domain::Ventilation , Domain::Piping , Domain::CableCarrier }
enum class  | ConnectorShape { ConnectorShape::Rectangular , ConnectorShape::Circular , ConnectorShape::UShape }
enum class  | ConnectionStyle { ConnectionStyle::NoConnector , ConnectionStyle::Flanged , ConnectionStyle::Overlap }
enum class  | FlowDirection { FlowDirection::FlowNotDefined , FlowDirection::FlowIn , FlowDirection::FlowOut }
enum class  | ConnectionSex { ConnectionSex::Unisex , ConnectionSex::Male , ConnectionSex::Female }
enum class  | PreferredTransitionPlacement { PreferredTransitionPlacement::SmallToLarge , PreferredTransitionPlacement::LargeToSmall }
enum class  | PreferenceTableShape { PreferenceTableShape::Rectangular , PreferenceTableShape::Circular }
 Functions
Result< AccessoryDefault >  | CreateAccessoryDefault (Domain domain)
Creates an AccessoryDefault.
MEPAPI_EXPORT GS::UniString  | GetLocalizedElemTypeName (const API_Guid &typeID)
Returns the localized name of MEP element types.
MEPAPI_EXPORT bool  | IsBranch (const API_Guid &typeID)
MEPAPI_EXPORT bool  | IsAccessory (const API_Guid &typeID)
MEPAPI_EXPORT bool  | IsEquipment (const API_Guid &typeID)
MEPAPI_EXPORT bool  | IsTerminal (const API_Guid &typeID)
MEPAPI_EXPORT bool  | IsRoutingElement (const API_Guid &typeID)
MEPAPI_EXPORT bool  | IsFitting (const API_Guid &typeID)
MEPAPI_EXPORT bool  | IsRigidSegment (const API_Guid &typeID)
MEPAPI_EXPORT bool  | IsBend (const API_Guid &typeID)
MEPAPI_EXPORT bool  | IsTransition (const API_Guid &typeID)
MEPAPI_EXPORT bool  | IsFlexibleSegment (const API_Guid &typeID)
Result< BendDefault >  | CreateBendDefault (Domain domain)
Creates a BendDefault.
Result< BranchDefault >  | CreateBranchDefault (Domain domain)
Creates a BranchDefault.
Result< CableCarrierPreferenceTableContainer >  | GetCableCarrierPreferenceTableContainer ()
Result< DuctPreferenceTableContainer >  | GetDuctPreferenceTableContainer ()
Result< EquipmentDefault >  | CreateEquipmentDefault ()
Creates an EquipmentDefault.
Result< FittingDefault >  | CreateFittingDefault (Domain domain)
Creates an FittingDefault.
Result< FlexibleSegmentDefault >  | CreateFlexibleSegmentDefault ()
Creates a FlexibleSegmentDefault.
Result< PipePreferenceTableContainer >  | GetPipePreferenceTableContainer ()
Result< RigidSegmentDefault >  | CreateRigidSegmentDefault (Domain domain)
Creates a RigidSegmentDefault.
Result< RoutingElementDefault >  | CreateRoutingElementDefault (Domain domain)
Creates a RoutingElementDefault.
Result< RoutingNodeDefault >  | CreateRoutingNodeDefault (Domain domain)
Creates a RoutingNodeDefault.
Result< RoutingSegmentDefault >  | CreateRoutingSegmentDefault (Domain domain)
Creates a RoutingSegmentDefault.
Result< TerminalDefault >  | CreateTerminalDefault (Domain domain)
Creates a TerminalDefault.
Result< TransitionDefault >  | CreateTransitionDefault (Domain domain)
Creates a TransitionDefault.
 Variables
MEPAPI_EXPORT const API_Guid  | VentilationBranchID
MEPAPI_EXPORT const API_Guid  | PipingBranchID
MEPAPI_EXPORT const API_Guid  | CableCarrierBranchID
MEPAPI_EXPORT const API_Guid  | VentilationTerminalID
MEPAPI_EXPORT const API_Guid  | PipingTerminalID
MEPAPI_EXPORT const API_Guid  | VentilationAccessoryID
MEPAPI_EXPORT const API_Guid  | PipingAccessoryID
MEPAPI_EXPORT const API_Guid  | EquipmentID
MEPAPI_EXPORT const API_Guid  | VentilationRoutingID
MEPAPI_EXPORT const API_Guid  | PipingRoutingID
MEPAPI_EXPORT const API_Guid  | CableCarrierRoutingID
MEPAPI_EXPORT const API_Guid  | VentilationFittingID
MEPAPI_EXPORT const API_Guid  | PipingFittingID
MEPAPI_EXPORT const API_Guid  | CableCarrierFittingID
MEPAPI_EXPORT const API_Guid  | VentilationRoutingSegmentID
MEPAPI_EXPORT const API_Guid  | PipingRoutingSegmentID
MEPAPI_EXPORT const API_Guid  | CableCarrierRoutingSegmentID
MEPAPI_EXPORT const API_Guid  | VentilationRoutingNodeID
MEPAPI_EXPORT const API_Guid  | PipingRoutingNodeID
MEPAPI_EXPORT const API_Guid  | CableCarrierRoutingNodeID
MEPAPI_EXPORT const API_Guid  | VentilationRigidSegmentID
MEPAPI_EXPORT const API_Guid  | PipingRigidSegmentID
MEPAPI_EXPORT const API_Guid  | CableCarrierRigidSegmentID
MEPAPI_EXPORT const API_Guid  | VentilationBendID
MEPAPI_EXPORT const API_Guid  | PipingBendID
MEPAPI_EXPORT const API_Guid  | CableCarrierBendID
MEPAPI_EXPORT const API_Guid  | VentilationTransitionID
MEPAPI_EXPORT const API_Guid  | PipingTransitionID
MEPAPI_EXPORT const API_Guid  | CableCarrierTransitionID
MEPAPI_EXPORT const API_Guid  | VentilationFlexibleSegmentID
Variable Documentation
◆ CableCarrierBendID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::CableCarrierBendID
extern
◆ CableCarrierBranchID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::CableCarrierBranchID
extern
◆ CableCarrierFittingID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::CableCarrierFittingID
extern
◆ CableCarrierRigidSegmentID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::CableCarrierRigidSegmentID
extern
◆ CableCarrierRoutingID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::CableCarrierRoutingID
extern
◆ CableCarrierRoutingNodeID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::CableCarrierRoutingNodeID
extern
◆ CableCarrierRoutingSegmentID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::CableCarrierRoutingSegmentID
extern
◆ CableCarrierTransitionID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::CableCarrierTransitionID
extern
◆ EquipmentID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::EquipmentID
extern
◆ PipingAccessoryID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::PipingAccessoryID
extern
◆ PipingBendID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::PipingBendID
extern
◆ PipingBranchID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::PipingBranchID
extern
◆ PipingFittingID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::PipingFittingID
extern
◆ PipingRigidSegmentID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::PipingRigidSegmentID
extern
◆ PipingRoutingID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::PipingRoutingID
extern
◆ PipingRoutingNodeID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::PipingRoutingNodeID
extern
◆ PipingRoutingSegmentID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::PipingRoutingSegmentID
extern
◆ PipingTerminalID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::PipingTerminalID
extern
◆ PipingTransitionID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::PipingTransitionID
extern
◆ VentilationAccessoryID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::VentilationAccessoryID
extern
◆ VentilationBendID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::VentilationBendID
extern
◆ VentilationBranchID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::VentilationBranchID
extern
◆ VentilationFittingID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::VentilationFittingID
extern
◆ VentilationFlexibleSegmentID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::VentilationFlexibleSegmentID
extern
◆ VentilationRigidSegmentID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::VentilationRigidSegmentID
extern
◆ VentilationRoutingID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::VentilationRoutingID
extern
◆ VentilationRoutingNodeID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::VentilationRoutingNodeID
extern
◆ VentilationRoutingSegmentID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::VentilationRoutingSegmentID
extern
◆ VentilationTerminalID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::VentilationTerminalID
extern
◆ VentilationTransitionID
 MEPAPI_EXPORT const API_Guid ACAPI::MEP::VentilationTransitionID
extern